In [1]:
import pandas as pd

# Identifying the Missing Data
    By using the methods:
        
        - '.isna()'
        - '.sum()'
        
        - The '.info()' method can also help identify null values

In [4]:
# Create a DataFrame
df = pd.DataFrame({
    'product': [pd.NA, 'Dairy', 'Dairy', pd.NA, 'Fruits'],
    'price': [2.56, pd.NA, 4.55, 2.74, pd.NA],
    'product_id': [1, 2, 3, 4, 5]
})

In [6]:
df.head()

  product price  product_id
0    <NA>  2.56           1
1   Dairy  <NA>           2
2   Dairy  4.55           3
3    <NA>  2.74           4
4  Fruits  <NA>           5

In [8]:
df.isna().sum()

product       2
price         2
product_id    0
dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   product     3 non-null      object
 1   price       3 non-null      object
 2   product_id  5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

# Handling Missing Data
    by using method
    
    - '.dropna()'
    
    - '.fillna()'

In [26]:
df.head()

  product  price  product_id
0       0   2.56           1
1   Dairy   0.00           2
2   Dairy   4.55           3
3       0   2.74           4
4  Fruits   0.00           5

In [27]:
df.fillna(0)

  product  price  product_id
0       0   2.56           1
1   Dairy   0.00           2
2   Dairy   4.55           3
3       0   2.74           4
4  Fruits   0.00           5

In [28]:
df.isna().sum()

product       0
price         0
product_id    0
dtype: int64

In [30]:
df

  product  price  product_id
0       0   2.56           1
1   Dairy   0.00           2
2   Dairy   4.55           3
3       0   2.74           4
4  Fruits   0.00           5

  product  price  product_id
0       0   2.56           1
1   Dairy   0.00           2
2   Dairy   4.55           3
3       0   2.74           4
4  Fruits   0.00           5

In [31]:
dfs = pd.DataFrame({
    'product': [pd.NA, 'Dairy', 'Dairy', pd.NA, 'Fruits'],
    'price': [2.56, pd.NA, 4.55, 2.74, pd.NA],
    'product_id': [1, 2, 3, 4, 5]
})

In [32]:
dfs.head()

  product price  product_id
0    <NA>  2.56           1
1   Dairy  <NA>           2
2   Dairy  4.55           3
3    <NA>  2.74           4
4  Fruits  <NA>           5

In [33]:
dfs.dropna()

  product price  product_id
2   Dairy  4.55           3

In [34]:
dfs

  product price  product_id
0    <NA>  2.56           1
1   Dairy  <NA>           2
2   Dairy  4.55           3
3    <NA>  2.74           4
4  Fruits  <NA>           5

In [35]:
dfs.fillna({'price': 0})

  product  price  product_id
0    <NA>   2.56           1
1   Dairy   0.00           2
2   Dairy   4.55           3
3    <NA>   2.74           4
4  Fruits   0.00           5

In [36]:
dfs.dropna(subset = ['product'])

  product price  product_id
1   Dairy  <NA>           2
2   Dairy  4.55           3
4  Fruits  <NA>           5

In [39]:
dfs.dropna(subset = ['price'])

  product price  product_id
0    <NA>  2.56           1
2   Dairy  4.55           3
3    <NA>  2.74           4